exitButton.bind('<Double-1>', openNotepad)

# Типы событий:
События, производимые мышью
<Button-1> - щелчок левой кнопкой мыши
<Button-2> - щелчок средней кнопкой мыши
<Button-3> - щелчок правой кнопкой мыши
<Double-Button-1> - двойной клик левой кнопкой мыши
<Motion> - движение мыши

События, производимые с помощью клавиатуры
    Буквенные клавиши можно записывать без угловых скобок (например, 'L').
    Для неалфавитных клавиш существуют специальные зарезервированные слова
    * <Return> - нажатие клавиши Enter;
    * <space>- пробел;
    * и т. д.
    Сочетания клавиш пишутся через тире. Например:
    * <Control-Shift> - одновременное нажатие клавиш Ctrl и Shift.