/* Поразрядные операторы */
~       // Поразрядное цнарное отрицание
&       // Поразрядное И
|       // Поразрядное ИЛИ
^       // Порзрядное исключающее ИЛИ
>>      // Сдвиг вправо
>>>     // Сдвиг вправо с заполнением старшего бита нулем
<<      // Сдвиг влево
&=      
|=      
^=      
>>=     
>>>=    
<<=     

/* Операции булевой логики */
&   // Логическое И
|   // Логическое ИЛИ
^   // Логическое исключающее ИЛИ
&&  // Укороченное И
!   // Логическое унарное отрицание
&=  // 
|=  // 
^=  // 
==  // Равно
!=  // Не равно
?:  // Тернарный оператор