/*
Специальные символы:
\b      Возврат на одну позицию     \u0008
\t      Табуляция                   \u0009
\n      Переход на новую строку     \u000a
\r      Возврат каретки             \u000d
\"      Двойная кавычка             \u0022
\'      Одинарная ковычка           \u0027
\\      Обратная косая черта        \u005c
\ddd    Восьмеричный символ
\uxxxx  Шестнатиричный символ
*/

str.length(); // Длина строки
str.equals(str1); // Проверка идентичности двух строк
str.charAt(5); // Получение пятого символа строки