// Контейнеры
<vector>	// Одномерный массив элементов T
<list>		// Двусвязный список элементов T
<deque>		// Двусторонняя очередь элементов T
<queue>		// Очередь элементов T
<stack>		// Стек элементов T
<map>		// Ассоциативный массив элементов T
<set>		// Множество элементов T
<bitset>	// Множество булевых переменных

// Общие средства
<utility>		// Операции и пары pairs
<functional>	// Объекты-функции
<memory>		// Аллокаторы для контейнеров
<ctime>			// Время и дата в стиле C

// Итераторы
<iterator>		// Итераторы и поддержка итераторов

// Алгоритмы
<alhorithm>		// Общие алгоритмы
<cstdlib>		// bsearch(), qsort()

// Диагностика
<exception>		// Класс исключений
<stdexcept>		// Стандартные исключения
<cassert>		// Макросы assert
<cerrno>		// Обработка ошибок в стиле C

// Строки
<string>	// Строка элементов T
<cctype>	// Классификация символов
<cwtype>	// Классификация символов из расширенного набора
<cstring>	// Функции над строками в стиле C
<cwcharp>	// Функции над строками "широких" символов в стиле C
<cstdlib>	// Функции над строками в стиле C

// Ввод-вывод
<iosfwd>	// Опережающие объявления средств ввода-вывода
<iostream>	// Стандартные объекты iostream и операции
<ios>		// Базовые классы для iostream
<streambuf>	// Буферы потоков
<istream>	// Шаблон потока ввода
<ostream>	// Шаблон потока вывода
<iomanip>	// Манипуляторы
<sstream>	// Потоки ввода вывода из в строки из строки
<cctype>	// Функции для работы с символами
<fstream>	// Потоки ввода-вывода в файлы
<cstdio>	// Семейство функций printf()
<cwchar>	// Ввод-вывод символов из расширенного набора

// Локализация
<locale>	// Представляет локальные особенности
<clocale>	// Представляет локальные особенности в стиле C

// Поддержка языка
<limits>	// Числовые пределы
<climits>	// Макросы числовых скалярных пределов в стиле C
<cfloat>	// Макросы пределов чисел с плавающей точкой в стиле C
<new>		// Динамическое распределение памяти
<typeinfo>	// Поддержка идентификации типов на этапе выполнения
<exception>	// Поддержка обработки исключений
<cstddef>	// Языковая поддержка библиотеки C
<cstdarg>	// Поддержка функций с переменным числом аргументов
<csetjmp>	// Раскрутка стека в стиле C
<cstdlib>	// Завершение программ
<ctime>		// Системные часы
<csignal>	// Обработка сигналов в стиле C

// Математика
<complex>	// Комплексные числа и операции с ними
<valarray>	// Векторы чисел и операции с ними
<numeric>	// Обобщенные числовые операции
<cmath>		// Стандартные математические функции
<cstdlib>	// Случайные числа в стиле C