public const double Pi = 3.14; // Объявление и инициализация константной переменной

/* Начальные значения переменных */

/*  Переменные класса
    
    Числовые переменные инициализируются нулем
    Переменные типа char также равны нулю '\0'
    Булевы переменные инициализируются false
    Объекты остаются неициилизированными и получают значение null
*/

// Локальные переменные не получают никаких начальных значений и должны быть инициализированы явно

// Переменные простых типов являются значениями, переменные объектов (создающиеся с помощью new) — ссылками