// Составная инструкция
{
    // Выражение 1
    // Выражение 2
    // Выражение 3
}

// Инструкция if ==============================================================

if () {}
else if () {}
else {}
    
// Инструкция switch ==========================================================

switch(x) {
    case 1:
        // ...
        break;
    // ...
    default:
        // ...
        break;
}

// Инструкция do while ========================================================

do {
    // ...
} while (x > 0)

// Инструкция for/in (foreach)
for(var x in arr) {
    alert(arr[x]);
    // ...
}

// var ========================================================================

var x = 0; // Свойства и переменные, создаваемые с помощью данной инструкции, не могут быть удалены оператором delete

// with =======================================================================

// Выполняет инструкции в области видимости объекта
with (window) {
    open('http://google.ru/', '_blank');
}

// Пустая инструкция ==========================================================
;