// Браузерные движки ==========================================================

Gecko // Открытый движок Firefox и других менее известных брузеров Mozilla
Webkit // Общий движок Safari (собственный JS-движок) и Chrome (Google V8)
Presto // Закрытый движок Opera
Trident // Закрытый движок Internet Explorer

// Уровни поддержки ===========================================================

A. Последние версии Firefox, Internet Explorer Safari/Chrome // Идеальная поддержка
B. Opera и предыдущие версии современных браузеров // Возможны незначительные помарки, не ломающие функционал
C. Старые браузеры // Поддерживаются только базовые возможности
D. Очень старые, текстовые браузеры // Не поддерживаются

// DOCTYPE ====================================================================

// Лучше всего использовать такое объявление
<!DOCTYPE HTML>

// Справочники на английском языке ============================================

'https://developer.mozilla.org/' // Содержит информацию, верную для основных браузеров. Также там присутствуют расширения только для Firefox
'http://msdn.microsoft.com/' // Справочник от Microsoft. В основном информация, специфичная для IE

'http://help.dottoro.com/'
'http://javascript.ru/manual'
'http://www.quirksmode.org/'