var x = 0; // Объявление и инициализация переменной

/* Ссылки ================================================================== */

// Числа, логические значения, null, undefined - элементарные типы
// Объекты, массивы и функции - ссылочные типы

/* Области видимости ======================================================= */

// Блочная области видимости отсутствует. Все переменные, объявленные внутри функции, независимо от того, где именно они объявлены, видимы всей функции.

// Все переменные являются также свойствами (функции или глобального объекта Window)