#include <cstdio>
char[] gets(); // Возвращает массив символов, считанный с клавиатуры

#include <cstring>
strcpy(to, from);
strcat(str1, str2);
strcmp(str1, str2); // Если строки равны, возвращает 0, если str1 > str2, возвращается +
strlen(str);

#include <cctype>
toupper('a'); // Возвращает 'A'
tolower('A'); // Возвращает 'a'
isalpha('a'); //  Буква ли
isdigit('8');
isspace();
ispunct();

// Управляющие символьные константы:
\b	// Пробел
\f	// Прогон бумаги
\n	// Новая строка
\r	// Возврат каретки
\t	// Горизонтальная табуляция
\"	// Двойная кавычка
\'	// Одинарная кавычка
\0	// Нуль
\\	// Обратная косая черта
\v	// Вертикальная табуляция
\a	// Звуковой сигнал
\?	// Знак вопроса
\N	// Восьмеричная константа N
\xN	// Шестнатиричная константа N