<QtAlgotithms>;
qBinaryFind(); // Двоичный поиск заданных значений.
qCopy(); // Копирование элементов, начиная с первого элемента.
qCopyBackward(); // Копирование элементов, начиная с последнего элемента.
qCount(); // Подсчет элементов контейнера.
qDeleteAll(); // Удаление всех элементов.
qEqual(begin1, end1, begin2); // Сравнение. Необходимо, чтобы все элементы имели оператор ==. или false
qFill(begin, end, value); // Присваивает каждому элементу заданное значение.
qFind(begin, end, value); // Поиск заданных значений. Возвращает итератор на элемент или end.
qLowerBound(); // Нахождение первого элмеента со значением, большим либо равным заданному.
qUpperBound(); // Нахождение первого элмеента со значением, большим заданному.
qSort(conteiner); // Сортировка элементов.
qStableSort(); // Сортировка элементов с сохранением порядка следования равных элементов.
qSwap(); // Меняет местами два значения.